garyPenhook/PyAvrOCD/svd/atmega649a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JTAG</name>
      <description>JTAG Interface</description>
      <baseAddress>0x00800051</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register (read-only for debugger)</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCDR</name>
          <description>On-Chip Debug Related Register in I/O Memory (write-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD</name>
      <description>Liquid Crystal Display</description>
      <baseAddress>0x008000E4</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x12</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x17</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LCDCCR</name>
          <description>LCD Contrast Control Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDCRA</name>
          <description>LCD Control Register A (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDBL</name>
              <description>LCD Blanking</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDIE</name>
              <description>LCD Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDIF</name>
              <description>LCD Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDAB</name>
              <description>LCD A or B waveform</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDEN</name>
              <description>LCD Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCRB</name>
          <description>LCD Control and Status Register B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDPM</name>
              <description>LCD Port Masks</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEG0_12</name>
                  <description>SEG0:12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_14</name>
                  <description>SEG0:14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_15</name>
                  <description>SEG0:15</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_18</name>
                  <description>SEG0:18</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_20</name>
                  <description>SEG0:20</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_22</name>
                  <description>SEG0:22</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_23</name>
                  <description>SEG0:23</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_24</name>
                  <description>SEG0:24</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_26</name>
                  <description>SEG0:26</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_28</name>
                  <description>SEG0:28</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_30</name>
                  <description>SEG0:30</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_32</name>
                  <description>SEG0:32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_34</name>
                  <description>SEG0:34</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_36</name>
                  <description>SEG0:36</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_38</name>
                  <description>SEG0:38</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_39</name>
                  <description>SEG0:39</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDMUX</name>
              <description>LCD Mux Selects</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LCD2B</name>
              <description>LCD 1/2 Bias Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCS</name>
              <description>LCD CLock Select</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDDR0</name>
          <description>LCD Data Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR1</name>
          <description>LCD Data Register 1</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR10</name>
          <description>LCD Data Register 10</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR11</name>
          <description>LCD Data Register 11</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR12</name>
          <description>LCD Data Register 12</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR13</name>
          <description>LCD Data Register 13</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR15</name>
          <description>LCD Data Register 15</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR16</name>
          <description>LCD Data Register 16</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR17</name>
          <description>LCD Data Register 17</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR18</name>
          <description>LCD Data Register 18</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR2</name>
          <description>LCD Data Register 2</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR3</name>
          <description>LCD Data Register 3</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR5</name>
          <description>LCD Data Register 5</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR6</name>
          <description>LCD Data Register 6</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR7</name>
          <description>LCD Data Register 7</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR8</name>
          <description>LCD Data Register 8</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDFRR</name>
          <description>LCD Frame Rate Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDCD</name>
              <description>LCD Clock Dividers</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDPS</name>
              <description>LCD Prescaler Selects</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKLCD_16</name>
                  <description>ClkLCD/16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_64</name>
                  <description>ClkLCD/64</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_128</name>
                  <description>ClkLCD/128</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_256</name>
                  <description>ClkLCD/256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_512</name>
                  <description>ClkLCD/512</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_1024</name>
                  <description>ClkLCD/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_2048</name>
                  <description>ClkLCD/2048</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_4096</name>
                  <description>ClkLCD/4096</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
